html/20231215T055820--add-ckeditor-into-django-app__django.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://arvydasg.github.io/devnotes/html/rss.xml"
      title="RSS feed for https://arvydasg.github.io/devnotes/html">
<title>add ckeditor into django app</title>
<meta name="author" content="Arvydas Gasparavicius">
<meta name="referrer" content="no-referrer">
<meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
<link rel="stylesheet" href="../static/style.css"/>
<link rel="icon" href="../static/ag.ico">
</head>
<body>
<div id="preamble" class="status"><br>preamble here yo</br></div>
<div id="content">
<div class="post-date">15 Dec 2023</div><h1 class="post-title"><a href="https://arvydasg.github.io/devnotes/html/20231215T055820--add-ckeditor-into-django-app__django.html">add ckeditor into django app</a></h1>
<p>
CKEditor - rich text field
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> pip install django-ckeditor</li>
<li class="off"><code>[&#xa0;]</code> <p>
add this inside models.py
</p>

<div class="org-src-container">
<pre class="src src-python">from ckeditor.fields import RichTextField

content = RichTextField(null=True, blank=True)  # add this
# content = models.TextField(null=True, blank=True) # instead of this
</pre>
</div></li>

<li class="off"><code>[&#xa0;]</code> python manage.py makemigrations</li>
<li class="off"><code>[&#xa0;]</code> python manage.py migrate</li>
<li class="off"><code>[&#xa0;]</code> add 'ckeditor' to settings.py installed apps</li>
<li class="off"><code>[&#xa0;]</code> <p>
add some config to give the editor more functionality. Inside settings.py
</p>
<div class="org-src-container">
<pre class="src src-python">CKEDITOR_CONFIGS = {
    'default': {
        'toolbar': 'full',
        'height': 300,
        'width': '100%',
        'skin': 'moono',
        'extraPlugins': ','.join(
            [
                'codesnippet',
            ]),
    },
}
</pre>
</div></li>
<li class="off"><code>[&#xa0;]</code> <p>
All blocks where Richtextfield was used, add |safe at the end, like so:
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;p&gt;{{project.content|safe}}&lt;/p&gt;
</pre>
</div>
<p>
Now go to base.html (head section) and add this to get syntax highlighting in
the browser. using <a href="https://highlightjs.org/">highlight.js</a> learned from <a href="https://www.youtube.com/watch?v=L6y6cn1XUfw&amp;t=450s">this - Django - CKEditor
Tutorial (+ CodeSnippet)</a> video
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/11.5.0/styles/base16/zenburn.min.css"&gt;
&lt;script src="//cdnjs.cloudflare.com/ajax/libs/highlight.js/11.5.0/highlight.min.js"&gt;&lt;/script&gt;
&lt;script&gt;hljs.highlightAll();&lt;/script&gt;
</pre>
</div></li>
</ul>
<div class="taglist"><a href="https://arvydasg.github.io/devnotes/html/tags.html">Tags</a>: <a href="https://arvydasg.github.io/devnotes/html/tag-django.html">django</a> </div></div>
<div id="postamble" class="status"><br>postamble in he house</br></div>
</body>
</html>
